===
Empty
===

print()

---

(source_file
  (expr
    base: (call)))

===
Basic 1
===

print(hi)

---

(source_file
  (expr
    base: (call
      arg: (expr
        base: (var_path)))))

===
Basic 2+
===

print(hi, hello, hey)

---

(source_file
  (expr
    base: (call
      arg: (expr
        base: (var_path))
      arg: (expr
        base: (var_path))
      arg: (expr
        base: (var_path)))))

===
Basic 2+ trailing
===

print(hi, hello, hey, )

---

(source_file
  (expr
    base: (call
      arg: (expr
        base: (var_path))
      arg: (expr
        base: (var_path))
      arg: (expr
        base: (var_path)))))

===
Basic 2+ trailing multiline
===

print(
    hi,
    hello,
    hey,
)

---

(source_file
  (expr
    base: (call
      arg: (expr
        base: (var_path))
      arg: (expr
        base: (var_path))
      arg: (expr
        base: (var_path)))))

===
Only named 1
===

print(foo=bar)

---

(source_file
  (expr
    base: (call
      named_arg: (call_named_arg
        value: (expr
          base: (var_path))))))

===
Only named 2+
===

print(foo=bar, a = b, c = d, )

---

(source_file
  (expr
    base: (call
      named_arg: (call_named_arg
        value: (expr
          base: (var_path)))
      named_arg: (call_named_arg
        value: (expr
          base: (var_path)))
      named_arg: (call_named_arg
        value: (expr
          base: (var_path))))))

===
Mixed
===

print(hello, hi, foo=bar, a = b, c = d, )

---

(source_file
  (expr
    base: (call
      arg: (expr
        base: (var_path))
      arg: (expr
        base: (var_path))
      named_arg: (call_named_arg
        value: (expr
          base: (var_path)))
      named_arg: (call_named_arg
        value: (expr
          base: (var_path)))
      named_arg: (call_named_arg
        value: (expr
          base: (var_path))))))
