===
Empty
===

print()

---

(source_file
  (expr_stmt
    (primary_expr
      (call
        func: (identifier)
        args: (call_arg_list)))))

===
Basic 1
===

print(hi)

---

(source_file
  (expr_stmt
    (primary_expr
      (call
        func: (identifier)
        args: (call_arg_list
          (primary_expr
            (var_path
              root: (identifier))))))))

===
Basic 2+
===

print(hi, hello, hey)

---

(source_file
  (expr_stmt
    (primary_expr
      (call
        func: (identifier)
        args: (call_arg_list
          (primary_expr
            (var_path
              root: (identifier)))
          (primary_expr
            (var_path
              root: (identifier)))
          (primary_expr
            (var_path
              root: (identifier))))))))

===
Basic 2+ trailing
===

print(hi, hello, hey, )

---

(source_file
  (expr_stmt
    (primary_expr
      (call
        func: (identifier)
        args: (call_arg_list
          (primary_expr
            (var_path
              root: (identifier)))
          (primary_expr
            (var_path
              root: (identifier)))
          (primary_expr
            (var_path
              root: (identifier))))))))

===
Basic 2+ trailing multiline
===

print(
    hi,
    hello,
    hey,
)

---

(source_file
  (expr_stmt
    (primary_expr
      (call
        func: (identifier)
        args: (call_arg_list
          (primary_expr
            (var_path
              root: (identifier)))
          (primary_expr
            (var_path
              root: (identifier)))
          (primary_expr
            (var_path
              root: (identifier))))))))

===
Only named 1
===

print(foo=bar)

---

(source_file
  (expr_stmt
    (primary_expr
      (call
        func: (identifier)
        args: (call_arg_list
          (call_named_arg
            name: (identifier)
            value: (primary_expr
              (var_path
                root: (identifier)))))))))

===
Only named 2+
===

print(foo=bar, a = b, c = d, )

---

(source_file
  (expr_stmt
    (primary_expr
      (call
        func: (identifier)
        args: (call_arg_list
          (call_named_arg
            name: (identifier)
            value: (primary_expr
              (var_path
                root: (identifier))))
          (call_named_arg
            name: (identifier)
            value: (primary_expr
              (var_path
                root: (identifier))))
          (call_named_arg
            name: (identifier)
            value: (primary_expr
              (var_path
                root: (identifier)))))))))

===
Mixed
===

print(hello, hi, foo=bar, a = b, c = d, )

---

(source_file
  (expr_stmt
    (primary_expr
      (call
        func: (identifier)
        args: (call_arg_list
          (primary_expr
            (var_path
              root: (identifier)))
          (primary_expr
            (var_path
              root: (identifier)))
          (call_named_arg
            name: (identifier)
            value: (primary_expr
              (var_path
                root: (identifier))))
          (call_named_arg
            name: (identifier)
            value: (primary_expr
              (var_path
                root: (identifier))))
          (call_named_arg
            name: (identifier)
            value: (primary_expr
              (var_path
                root: (identifier)))))))))
