===
Padding
===

"hello {name:20}"

---

(source_file
  (expr
    base: (primary_expr
      (literal
        (string
          start: (string_start)
          contents: (string_contents
            content: (string_content)
            interpolation: (interpolation
              expr: (expr
                base: (var_path))
              format: (format_specifier
                padding: (int))))
          end: (string_end))))))

===
Decimals
===

"hello {name:.4}"

---

(source_file
  (expr
    base: (primary_expr
      (literal
        (string
          start: (string_start)
          contents: (string_contents
            content: (string_content)
            interpolation: (interpolation
              expr: (expr
                base: (var_path))
              format: (format_specifier
                precision: (int))))
          end: (string_end))))))

===
Padding & Decimals
===

"hello {name:20.4}"

---

(source_file
  (expr
    base: (primary_expr
      (literal
        (string
          start: (string_start)
          contents: (string_contents
            content: (string_content)
            interpolation: (interpolation
              expr: (expr
                base: (var_path))
              format: (format_specifier
                padding: (int)
                precision: (int))))
          end: (string_end))))))

===
Left align
===

"hello {name:<20.4}"

---

(source_file
  (expr
    base: (primary_expr
      (literal
        (string
          start: (string_start)
          contents: (string_contents
            content: (string_content)
            interpolation: (interpolation
              expr: (expr
                base: (var_path))
              format: (format_specifier
                padding: (int)
                precision: (int))))
          end: (string_end))))))

===
Right align
===

"hello {name:>20.4}"

---

(source_file
  (expr
    base: (primary_expr
      (literal
        (string
          start: (string_start)
          contents: (string_contents
            content: (string_content)
            interpolation: (interpolation
              expr: (expr
                base: (var_path))
              format: (format_specifier
                padding: (int)
                precision: (int))))
          end: (string_end))))))
